#pragma warning(disable : 4191)
#pragma warning(disable : 4668)
#pragma warning(disable : 4710)
#pragma warning(disable : 4711)
#pragma warning(disable : 4820)
#pragma warning(disable : 5039)
#pragma warning(disable : 5045)
#pragma warning(disable : 6011)
#pragma warning(disable : 6308)
#pragma warning(disable : 6387)
#pragma warning(disable : 28182)

#pragma comment(lib, "Opengl32.lib")

#ifndef FAST_GL_H
#define FAST_GL_H

#include <assert.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <limits.h>
#include <time.h>
#include <math.h>

#include <Windows.h>

#include <gl/GL.h>

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

	///////////////////////////////////////////////////////////////
	// Configuration
	///////////////////////////////////////////////////////////////

#ifdef _DEBUG
#define FAST_GL_DEBUG
#endif //_DEBUG

	///////////////////////////////////////////////////////////////
	// Global Macros
	///////////////////////////////////////////////////////////////

#define STATIC_ASSERT(EXPRESSION, MESSAGE) typedef char static_assertion_##MESSAGE[(EXPRESSION) ? 1 : -1]

#define OFFSET_OF(TYPE, MEMBER) ((long long unsigned)&(((TYPE*)0)->MEMBER))

#define MAX(A, B) (((A) > (B)) ? (A) : (B))
#define MIN(A, B) (((A) < (B)) ? (A) : (B))

#define PI (3.1415926F)
#define SQRT_3 (1.7320508F)
#define EPSILON_2 (1E-2F)
#define EPSILON_3 (1E-3F)
#define EPSILON_4 (1E-4F)
#define EPSILON_5 (1E-5F)
#define EPSILON_6 (1E-6F)
#define EPSILON_7 (1E-7F)


	///////////////////////////////////////////////////////////////

#define SHADER_GL_VERSION \
	"#version 460 core\n"

#define SHADER_CONSTANTS \
	"const float PI = 3.1415926;" \
	"const float TAU = 6.2831853;" \

#define SHADER_RANDOM_IMPLEMENTATION \
	"const vec4 RANDOM_SCALE = vec4(443.897, 441.423, .0973, .1099);" \
	"vec2 Random2(vec2 Position) {" \
	"	vec3 p3 = fract(Position.xyx * RANDOM_SCALE.xyz);" \
	"	p3 += dot(p3, p3.yzx + 19.19);" \
	"	return fract((p3.xx + p3.yz) * p3.zy);" \
	"}" \
	"vec2 Random2(vec3 Position) {" \
	"	vec3 p3 = fract(Position * RANDOM_SCALE.xyz);" \
	"	p3 += dot(p3, p3.yzx + 19.19);" \
	"	return fract((p3.xx + p3.yz) * p3.zy);" \
	"}" \
	"vec3 Random3(vec2 Position) {" \
	"	vec3 p3 = fract(vec3(Position.xyx) * RANDOM_SCALE.xyz);" \
	"	p3 += dot(p3, p3.yxz + 19.19);" \
	"	return fract((p3.xxy + p3.yzz) * p3.zyx);" \
	"}" \
	"vec3 Random3(vec3 Position) {" \
	"	Position = fract(Position * RANDOM_SCALE.xyz);" \
	"	Position += dot(Position, Position.yxz + 19.19);" \
	"	return fract((Position.xxy + Position.yzz) * Position.zyx);" \
	"}"

#define SHADER_VORONOI_IMPLEMENTATION \
	"float Voronoi2D(vec2 Position, float AngleOffset, float Radius, float Density) {" \
	"	vec2 n = floor(Position * Density);" \
	"	vec2 f = fract(Position * Density);" \
	"	float f1 = 8.0;" \
	"	for (int j = -1; j <= 1; j++) {" \
	"		for (int i = -1; i <= 1; i++) {" \
	"			vec2 g = vec2(i, j);" \
	"			vec2 o = Random2(n + g);" \
	"			o = 0.5 + 0.41 * sin(AngleOffset + TAU * o);" \
	"			vec2 r = (g - f + o) * Radius;" \
	"			float d = sqrt(dot(r,r));" \
	"			if (d < f1) {" \
	"				f1 = d;" \
	"			}" \
	"		}" \
	"	}" \
	"	return f1;" \
	"}"

#define SHADER_VORONOISE_IMPLEMENTATION \
	"float Voronoise2D(vec2 Position, float U, float V) {" \
	"	float k = 1.0 + 63.0 * pow(1.0 - V, 6.0);" \
	"	vec2 i = floor(Position);" \
	"	vec2 f = fract(Position);" \
	"	vec2 a = vec2(0.0, 0.0);" \
	"	vec2 g = vec2(-2.0);" \
	"	for (g.y = -2.0; g.y <= 2.0; g.y++) {" \
	"		for (g.x = -2.0; g.x <= 2.0; g.x++) {" \
	"			vec3 o = Random3(i + g) * vec3(U, U, 1.0);" \
	"			vec2 d = g - f + o.xy;" \
	"			float w = pow(1.0 - smoothstep(0.0, 1.414, length(d)), k);" \
	"			a += vec2(o.z * w, w);" \
	"		}" \
	"	}" \
	"	return a.x / a.y;" \
	"}" \
	"float Voronoise3D(vec3 Position, float U, float V) {" \
	"	float k = 1.0 + 63.0 * pow(1.0 - V, 6.0);" \
	"	vec3 i = floor(Position);" \
	"	vec3 f = fract(Position);" \
	"	float s = 1.0 + 31.0 * V;" \
	"	vec2 a = vec2(0.0, 0.0);" \
	"	vec3 g = vec3(-2.0);" \
	"	for (g.z = -2.0; g.z <= 2.0; g.z++) {" \
	"		for (g.y = -2.0; g.y <= 2.0; g.y++) {" \
	"			for (g.x = -2.0; g.x <= 2.0; g.x++) {" \
	"				vec3 o = Random3(i + g) * vec3(U, U, 1.);" \
	"				vec3 d = g - f + o + 0.5;" \
	"				float w = pow(1.0 - smoothstep(0.0, 1.414, length(d)), k);" \
	"				a += vec2(o.z * w, w);" \
	"			}" \
	"		}" \
	"	}" \
	"	return a.x / a.y;" \
	"}"

	///////////////////////////////////////////////////////////////
	// Platform Checks
	///////////////////////////////////////////////////////////////

	STATIC_ASSERT(sizeof(char) == 1, invalid_size_detected);
	STATIC_ASSERT(sizeof(short) == 2, invalid_size_detected);
	STATIC_ASSERT(sizeof(int) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(long) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(long long) == 8, invalid_size_detected);
	STATIC_ASSERT(sizeof(float) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(double) == 8, invalid_size_detected);

	///////////////////////////////////////////////////////////////
	// WindowsGL Definition
	///////////////////////////////////////////////////////////////

	typedef HGLRC(*glCreateContext_PROC)(HDC DeviceContext);
	typedef BOOL(*glMakeCurrent_PROC)(HDC DeviceContext, HGLRC GraphicsContext);
	typedef PROC(*glGetProcAddress_PROC)(LPCSTR ProcedureName);
	typedef BOOL(*glDeleteContext_PROC)(HGLRC GraphicsContext);

#ifdef FAST_GL_IMPLEMENTATION
	static glCreateContext_PROC glCreateContext = 0;
	static glMakeCurrent_PROC glMakeCurrent = 0;
	static glGetProcAddress_PROC glGetProcAddress = 0;
	static glDeleteContext_PROC glDeleteContext = 0;
#endif // FAST_GL_IMPLEMENTATION

	///////////////////////////////////////////////////////////////
	// OpenGL Definition
	///////////////////////////////////////////////////////////////

#define GL_DEBUG_OUTPUT (0x92E0)
#define GL_DEBUG_SEVERITY_NOTIFICATION (0x826B)
