#pragma warning(disable : 4191)
#pragma warning(disable : 4255)
#pragma warning(disable : 4668)
#pragma warning(disable : 4710)
#pragma warning(disable : 4711)
#pragma warning(disable : 4774)
#pragma warning(disable : 4820)
#pragma warning(disable : 5039)
#pragma warning(disable : 5045)
#pragma warning(disable : 5246)
#pragma warning(disable : 6011)
#pragma warning(disable : 6308)
#pragma warning(disable : 6387)
#pragma warning(disable : 28182)

#pragma comment(lib, "Opengl32.lib")

#define _CRT_SECURE_NO_WARNINGS

#ifndef FAST_GL_H
#define FAST_GL_H

#include <assert.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <limits.h>
#include <time.h>
#include <math.h>
#include <stdarg.h>

#include <Windows.h>

#include <gl/GL.h>

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

	///////////////////////////////////////////////////////////////
	// Configuration
	///////////////////////////////////////////////////////////////

#ifdef _DEBUG
#define FAST_GL_DEBUG
#define FAST_GL_REFERENCE_COUNT
#endif // _DEBUG

#define FAST_GL_VECTOR_INITIAL_CAPACITY (16ULL)

#define FAST_GL_HASH_MAP_INITIAL_CAPACITY (128ULL)
#define FAST_GL_HASH_MAP_INITIAL_HASH (5381ULL)
#define FAST_GL_HASH_MAP_LOAD_FACTOR (0.75F)

#define FAST_GL_TEXT_FMT_BUFFER_SIZE (0x1000ULL)

	///////////////////////////////////////////////////////////////
	// Global Macros
	///////////////////////////////////////////////////////////////


	"	vec4 g1010 = vec4(gx10.y, gy10.y, gz10.y, gw10.y);" \
	"	vec4 g0110 = vec4(gx10.z, gy10.z, gz10.z, gw10.z);" \
	"	vec4 g1110 = vec4(gx10.w, gy10.w, gz10.w, gw10.w);" \
	"	vec4 g0001 = vec4(gx01.x, gy01.x, gz01.x, gw01.x);" \
	"	vec4 g1001 = vec4(gx01.y, gy01.y, gz01.y, gw01.y);" \
	"	vec4 g0101 = vec4(gx01.z, gy01.z, gz01.z, gw01.z);" \
	"	vec4 g1101 = vec4(gx01.w, gy01.w, gz01.w, gw01.w);" \
	"	vec4 g0011 = vec4(gx11.x, gy11.x, gz11.x, gw11.x);" \
	"	vec4 g1011 = vec4(gx11.y, gy11.y, gz11.y, gw11.y);" \
	"	vec4 g0111 = vec4(gx11.z, gy11.z, gz11.z, gw11.z);" \
	"	vec4 g1111 = vec4(gx11.w, gy11.w, gz11.w, gw11.w);" \
	"	vec4 norm00 = taylorInvSqrt(vec4(dot(g0000, g0000), dot(g0100, g0100), dot(g1000, g1000), dot(g1100, g1100)));" \
	"	g0000 *= norm00.x;" \
	"	g0100 *= norm00.y;" \
	"	g1000 *= norm00.z;" \
	"	g1100 *= norm00.w;" \
	"	vec4 norm01 = taylorInvSqrt(vec4(dot(g0001, g0001), dot(g0101, g0101), dot(g1001, g1001), dot(g1101, g1101)));" \
	"	g0001 *= norm01.x;" \
	"	g0101 *= norm01.y;" \
	"	g1001 *= norm01.z;" \
	"	g1101 *= norm01.w;" \
	"	vec4 norm10 = taylorInvSqrt(vec4(dot(g0010, g0010), dot(g0110, g0110), dot(g1010, g1010), dot(g1110, g1110)));" \
	"	g0010 *= norm10.x;" \
	"	g0110 *= norm10.y;" \
	"	g1010 *= norm10.z;" \
	"	g1110 *= norm10.w;" \
	"	vec4 norm11 = taylorInvSqrt(vec4(dot(g0011, g0011), dot(g0111, g0111), dot(g1011, g1011), dot(g1111, g1111)));" \
	"	g0011 *= norm11.x;" \
	"	g0111 *= norm11.y;" \
	"	g1011 *= norm11.z;" \
	"	g1111 *= norm11.w;" \
	"	float n0000 = dot(g0000, Pf0);" \
	"	float n1000 = dot(g1000, vec4(Pf1.x, Pf0.yzw));" \
	"	float n0100 = dot(g0100, vec4(Pf0.x, Pf1.y, Pf0.zw));" \
	"	float n1100 = dot(g1100, vec4(Pf1.xy, Pf0.zw));" \
	"	float n0010 = dot(g0010, vec4(Pf0.xy, Pf1.z, Pf0.w));" \
	"	float n1010 = dot(g1010, vec4(Pf1.x, Pf0.y, Pf1.z, Pf0.w));" \
	"	float n0110 = dot(g0110, vec4(Pf0.x, Pf1.yz, Pf0.w));" \
	"	float n1110 = dot(g1110, vec4(Pf1.xyz, Pf0.w));" \
	"	float n0001 = dot(g0001, vec4(Pf0.xyz, Pf1.w));" \
	"	float n1001 = dot(g1001, vec4(Pf1.x, Pf0.yz, Pf1.w));" \
	"	float n0101 = dot(g0101, vec4(Pf0.x, Pf1.y, Pf0.z, Pf1.w));" \
	"	float n1101 = dot(g1101, vec4(Pf1.xy, Pf0.z, Pf1.w));" \
	"	float n0011 = dot(g0011, vec4(Pf0.xy, Pf1.zw));" \
	"	float n1011 = dot(g1011, vec4(Pf1.x, Pf0.y, Pf1.zw));" \
	"	float n0111 = dot(g0111, vec4(Pf0.x, Pf1.yzw));" \
	"	float n1111 = dot(g1111, Pf1);" \
	"	vec4 fade_xyzw = quintic(Pf0);" \
	"	vec4 n_0w = mix(vec4(n0000, n1000, n0100, n1100), vec4(n0001, n1001, n0101, n1101), fade_xyzw.w);" \
	"	vec4 n_1w = mix(vec4(n0010, n1010, n0110, n1110), vec4(n0011, n1011, n0111, n1111), fade_xyzw.w);" \
	"	vec4 n_zw = mix(n_0w, n_1w, fade_xyzw.z);" \
	"	vec2 n_yzw = mix(n_zw.xy, n_zw.zw, fade_xyzw.y);" \
	"	float n_xyzw = mix(n_yzw.x, n_yzw.y, fade_xyzw.x);" \
	"	return 2.2 * n_xyzw;" \
	"}" \
	GLSL_END_INCLUDE_GUARD(GLSL_PERLIN_NOISE_IMPLEMENTATION)

	///////////////////////////////////////////////////////////////
	// Platform Checks
	///////////////////////////////////////////////////////////////

	STATIC_ASSERT(sizeof(char) == 1, invalid_size_detected);
	STATIC_ASSERT(sizeof(short) == 2, invalid_size_detected);
	STATIC_ASSERT(sizeof(int) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(long) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(long long) == 8, invalid_size_detected);
	STATIC_ASSERT(sizeof(float) == 4, invalid_size_detected);
	STATIC_ASSERT(sizeof(double) == 8, invalid_size_detected);

	///////////////////////////////////////////////////////////////
	// WindowsGL Definition
	///////////////////////////////////////////////////////////////

	typedef HGLRC(*glCreateContext_PROC)(HDC DeviceContext);
	typedef BOOL(*glMakeCurrent_PROC)(HDC DeviceContext, HGLRC GraphicsContext);
	typedef PROC(*glGetProcAddress_PROC)(LPCSTR ProcedureName);
	typedef BOOL(*glDeleteContext_PROC)(HGLRC GraphicsContext);

#ifdef FAST_GL_IMPLEMENTATION
	static glCreateContext_PROC glCreateContext = 0;
	static glMakeCurrent_PROC glMakeCurrent = 0;
	static glGetProcAddress_PROC glGetProcAddress = 0;
	static glDeleteContext_PROC glDeleteContext = 0;
#endif // FAST_GL_IMPLEMENTATION

	///////////////////////////////////////////////////////////////
	// OpenGL Definition
	///////////////////////////////////////////////////////////////

#define GL_DEBUG_OUTPUT (0x92E0)
#define GL_DEBUG_SEVERITY_NOTIFICATION (0x826B)
